### Conexão Banco SQL server

In [1]:
import pyodbc
import pandas as pd
import copy

server = 'd64v38i'
username = 'user_sa_licenciamento_leitura_ext'
password = '1qEr3@ext'
database = 'sa_licenciamento'

connection_string = 'DRIVER={SQL Server};SERVER='+server+';DATABASE='+database+';UID='+username+';PWD='+ password

# Conectar ao banco de dados
connection = pyodbc.connect(connection_string)

# Consulta SQL
def sql_query(query):
    return pd.read_sql(query, connection)

### Importando as tabelas - sql_incra, assunto, endereço

In [2]:
# SQL_INCRA
df_sql_incra = sql_query('SELECT * FROM dbo.prata_sql_incra')
df_sql_incra.info()

C:\Users\d850398\AppData\Local\Temp\ipykernel_24956\1644747194.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  return pd.read_sql(query, connection)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682986 entries, 0 to 1682985
Data columns (total 12 columns):
 #   Column                Non-Null Count    Dtype
---  ------                --------------    -----
 0   id_prata_sql_incra    1682986 non-null  int64
 1   id_prata_assunto      1682986 non-null  int64
 2   sistema               1682986 non-null  object
 3   processo              1676965 non-null  object
 4   protocolo             262745 non-null   object
 5   codigoAssuntoObra     1682986 non-null  object
 6   sql_incra             1682672 non-null  object
 7   tipoSql_incra         1682956 non-null  object
 8   origem_carga          1450858 non-null  object
 9   origem_sql_incra      1682672 non-null  object
 10  dtcarga               1682986 non-null  datetime64[ns]
 11  origem_tipoSql_incra  1522946 non-null  object
dtypes: datetime64[ns](1), int64(2), object(9)
memory usage: 154.1+ MB

In [7]:
sql_incra = df_sql_incra[['sql_incra']][:]

In [9]:
sql_incra['caracteres'] = sql_incra['sql_incra'].apply(lambda x: len(x) if x else None)
sql_incra.head()

        sql_incra  caracteres
0  116.241.0014-6        14.0
1  116.241.0014-6        14.0
2  010.010.0022-6        14.0
3  007.059.0022-3        14.0
4  123.027.0217-3        14.0

In [16]:
sql_incra.query("caracteres != 14")

                   sql_incra  caracteres
96       Antonia Maria Nigro        19.0
565               residencia        10.0
765            6351970257550        13.0
815                      Rua         3.0
924            6383580148180        13.0
...                      ...         ...
1682673        6383580122629        13.0
1682691                 None         NaN
1682817    638.358.049.042-3        17.0
1682933                 None         NaN
1682963                 None         NaN

[17946 rows x 2 columns]